app/controllers/places_controller.rb

SELECT * FROM "places" WHERE ((name LIKE '%1%' or description LIKE '%1%') and country = '1')
---
  def index
    @countries = Country.find(:all)
    if params[:keywords] and not params[:keywords].empty?
      if params[:country_id] and not params[:country_id].empty?
        @places = Place.find(:all, :conditions => ['(name LIKE ? or description LIKE ?) and country = ?', "%#{params[:keywords]}%", "%#{params[:keywords]}%", params[:country_id]])

SELECT * FROM "places" WHERE ("places"."id" = 0)
---
  def show
    @place = Place.find(params[:id])

SELECT * FROM "places" WHERE ("places"."id" = 4)
---
  def edit
    @place = Place.find(params[:id])

INSERT INTO "places" ("name", "coordinates_long", "image_url", "updated_at", "date", "country", "author", "coordinates_lat", "rank", "description", "direction", "created_at") VALUES('asdas', 123.0, 'qweqwe.png', '2010-07-14 13:11:32', '2010-07-14', 0, 'qweq', 123.0, 3, 'qweqweq', NULL, '2010-07-14 13:11:32')
---
  def create
    @place = Place.new(params[:place])
    @place.user = @current_user
    if @place.save

SELECT * FROM "places" WHERE ("places"."id" = 2)
UPDATE "places" SET "image_url" = '/images/autocaravana1.jpg', "description" = 'Esta es mi casa en Valencia', "updated_at" = '2010-07-17 13:19:19' WHERE "id" = 1
---
  def update
    @place = Place.find(params[:id])
    if @place.update_attributes(params[:place])