app/controllers/routes_controller.rb

  def index
      @routes = Route.search(params[:search])
---
SELECT * FROM "routes" WHERE ((routes.name LIKE '%Route1%' or routes.description LIKE '%Route1%' ))

  def show
    @route = Route.find(params[:id])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 2)

  def edit
    @route = Route.find(params[:id])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)

  def update
    @route = Route.find(params[:id])

    respond_to do |format|
      if @route.update_attributes(params[:route])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 1)
UPDATE "routes" SET "name" = 'Mi ruta por los países eslavos', "updated_at" = '2010-07-17 16:14:31' WHERE "id" = 1