app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "photo_url", "profile", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "is_admin", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2010-07-18 15:56:31', '2010-07-18 15:56:31', '/images/autocaravana1.jpg', 'Hola! Me llamo Pepa', 'e8d493ad76c57e76c3e49f15754cd4c866a7c6f0057768bd0cf98b2e2660821a13d278b1ac79042949210e8715295422ed32e2405f24e9525ebaa642be55c78c', '_oUJ8gRreHx_0OAhAnJK', 'VhOwblvEP7K2XOf8ZgmY', '127.0.0.1', 'f', '0nKREABCOQYC9UjzXugc', '2010-07-18 15:56:31', 0, '45a4d699e7fae45bc3b272e58bdd6d6ea9aa01cec7595db60885640e48ccbeb7a340837e34eb1adfda69e0cc12a7582be797b86fe77e9bdea89305f64be967fb', 1, 'Pepaaaaaaa', 'pepe@pepe.es', NULL, '2010-07-18 15:56:31')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "photo_url" = '/autocaravana2.png', "hashed_password" = '4d07e84fa9a2c938b8b697cf71b810f39329d547', "updated_at" = '2010-07-17 13:16:21', "salt" = 'kpqx3UwPGw' WHERE "id" = 7